---
title: UpdaterInfo
classe: Autodesk.Revit.DB.UpdaterInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# UpdaterInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String AdditionalInformation { get; }` | `updaterInfo.AdditionalInformation` | String |
| `String ApplicationName { get; }` | `updaterInfo.ApplicationName` | String |
| `Boolean IsOptional { get; }` | `updaterInfo.IsOptional` | Boolean |
| `Boolean IsValidObject { get; }` | `updaterInfo.IsValidObject` | Boolean |
| `String UpdaterName { get; }` | `updaterInfo.UpdaterName` | String |
| `Void Dispose()` | `updaterInfo.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```